tsung/scenario.xml
<?xml version="1.0"?>
<!DOCTYPE tsung
  SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">
    <clients>
        <client host="localhost" use_controller_vm="true"/>
    </clients>
    <servers>
        <server host="192.168.0.100" port="3000" type="tcp"/>
    </servers>
    <load duration="10" unit="minute">
        <arrivalphase phase="1" duration="5" unit="minute">
            <users maxnumber="1" interarrival="1" unit="second"/>
        </arrivalphase>
    </load>
    <options>
        <option name="file_server" id="filmlist" value="./film.csv"/>
    </options>
    <sessions>
        <session name="query_session" probability="100" type="ts_http">
            <for from="1" to="10000" var="i">
                <setdynvars sourcetype="file" fileid="filmlist" delimiter=";" order="iter">
                    <var name="title" />
                </setdynvars>

                <request subst="true">
                    <http url="/api/movie?title=%%_title%%" version="1.1" method="GET">
                        <http_header name='Accept' value='*/*' />
                        <http_header name='Accept-Encoding' value='gzip, deflate, br' />
                        <http_header name='Accept-Language' value='en-US,en;q=0.5' />
                    </http>
                </request>
            </for>
        </session>
    </sessions>
</tsung>